bases/Wim_Du/projects/IMDEV-8899 Вечерние регламенты Этап2/Расширения/rev2/Catalogs/РегламентныеПериоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РегламентныеПериоды</Name>
		</Properties>
	</Catalog>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8899 Вечерние регламенты Этап2/Расширения/rev2/InformationRegisters/ВидыОптимизируемыхРегламентныхОперацийДУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВидыОптимизируемыхРегламентныхОперацийДУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-8899 Вечерние регламенты Этап2/Расширения/rev2/Catalogs/РегламентныеПериоды/Forms/РегламентныйПериод/Ext/Form/Module.bsl
&НаСервере
&ИзменениеИКонтроль("ПолучитьДоговораДУпоДинамическомуСписку")
Функция rev2_ПолучитьДоговораДУпоДинамическомуСписку(УчитыватьВыполненные)
	РеглПериод = Справочники.РегламентныеПериоды.ПериодПоДате(ДатаПериода);
	
	СписокДоговоровДУ = Справочники.ДоговорДУ.СписокДоговоровДУПоДинамическомуСписку(ДатаПериода, ДоговораДУ);
	
	// Создаем таблицу Список операций
	РеглОперацииПлан 	=  РегистрыСведений.НастройкиЗакрытияПериода.ПланРеглОпераций(ДатаПериода, СписокДоговоровДУ, ГруппаРегламентныхОпераций);
	
	СписокОпераций = Новый ТаблицаЗначений;
	СписокОпераций.Колонки.Добавить("ДоговорДУ", 		Новый ОписаниеТипов("СправочникСсылка.ДоговорДУ"));
	СписокОпераций.Колонки.Добавить("ВидОперации",		Новый ОписаниеТипов("СправочникСсылка.ВидыОперацийЗакрытияПериода"));
	СписокОпераций.Колонки.Добавить("Выполнять", 		Новый ОписаниеТипов("Булево"));
	СписокОпераций.Колонки.Добавить("ВремяРеглОпераций",Новый ОписаниеТипов("Дата"));
	СписокОпераций.Колонки.Добавить("ГруппаОперацийПользователя",			Новый ОписаниеТипов("СправочникСсылка.ВидыОперацийЗакрытияПериода"));
	
	//Установленные операции
	Дерево = ДеревоРеглОпераций.ПолучитьЭлементы();
	Для Каждого ТекГруппа из Дерево Цикл 
		
		РеглОперации = ТекГруппа.ПолучитьЭлементы();
		Если РеглОперации.Количество() > 0 И НЕ ЗначениеЗаполнено(РеглОперации[0].ВидОперации) Тогда
			
			Для каждого ТекПодгруппа Из РеглОперации Цикл
				
				Для Каждого ТекОперация из	ТекПодгруппа.ПолучитьЭлементы() Цикл
					
					Если ТекОперация.Факт = 0 тогда продолжить; КонецЕсли;
					
					ПараметрыПоиска = Новый Структура("ВидОперации", ТекОперация.ВидОперации);
					НайденныеСтроки = РеглОперацииПлан.НайтиСтроки(ПараметрыПоиска);
					
					Для каждого ТекСтрока из НайденныеСтроки Цикл
						
						Если ТекСтрока.Выполнять = 0 и ТекОперация.Факт = 2 тогда продолжить; КонецЕсли;
						
						НовыйФакт = СписокОпераций.Добавить();
						НовыйФакт.ДоговорДУ = ТекСтрока.ДоговорДУ;
						НовыйФакт.ВидОперации = ТекСтрока.ВидОперации;
						НовыйФакт.ВремяРеглОпераций = ТекСтрока.ВремяРеглОпераций;
						НовыйФакт.ГруппаОперацийПользователя = ТекСтрока.Родитель;
						НовыйФакт.Выполнять = Истина;
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЦикла;
			
		Иначе	
			
			Для Каждого ТекОперация из	РеглОперации Цикл
				
				Если ТекОперация.Факт = 0 тогда продолжить; КонецЕсли;
				
				ПараметрыПоиска = Новый Структура("ВидОперации", ТекОперация.ВидОперации);
				НайденныеСтроки = РеглОперацииПлан.НайтиСтроки(ПараметрыПоиска);
				
				Для каждого ТекСтрока из НайденныеСтроки Цикл
					
					Если ТекСтрока.Выполнять = 0 и ТекОперация.Факт = 2 тогда продолжить; КонецЕсли;
					
					НовыйФакт = СписокОпераций.Добавить();
					НовыйФакт.ДоговорДУ = ТекСтрока.ДоговорДУ;
					НовыйФакт.ВидОперации = ТекСтрока.ВидОперации;
					НовыйФакт.ВремяРеглОпераций = ТекСтрока.ВремяРеглОпераций;
					НовыйФакт.ГруппаОперацийПользователя = ТекСтрока.Родитель;
					НовыйФакт.Выполнять = Истина;
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
	#Вставка
	Если Константы.ИспользоватьПредварительныеЗапросыДляВечернихРегламентов.Получить() Тогда
		РегистрыСведений.ВидыОптимизируемыхРегламентныхОперацийДУ.ОтфильтроватьСписокОперацийЗакрытия(
			ДатаПериода, СписокОпераций, СписокДоговоровДУ);
	КонецЕсли;
	#КонецВставки
	СписокОпераций.Индексы.Добавить("ДоговорДУ");
	#Вставка
	// IMDEV-8899 3.6: составной индекс под НайтиСтроки в СформироватьДокументыЗакрытияПериода
	СписокОпераций.Индексы.Добавить("ДоговорДУ,ГруппаОперацийПользователя");
	#КонецВставки
	
	//Получаем таблицузначений ДокументыПоДоговорам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ПланРегламентныхОперацийДУ.ДоговорДУ КАК ДоговорДУ,
	               |	ПланРегламентныхОперацийДУ.Ссылка КАК Ссылка,
	               |	ПланРегламентныхОперацийДУ.Дата КАК Дата,
	               |	ПланРегламентныхОперацийДУ.ГруппаОперацийПользователя КАК ГруппаОперацийПользователя
	               |ИЗ
	               |	Документ.ПланРегламентныхОперацийДУ КАК ПланРегламентныхОперацийДУ
	               |ГДЕ
	               |	ПланРегламентныхОперацийДУ.ДоговорДУ В(&ДоговорДУ)
	               |	И ПланРегламентныхОперацийДУ.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	               |	И ПланРегламентныхОперацийДУ.ГруппаОперацийПользователя = &ГруппаОперацийПользователя
	               |	И ПланРегламентныхОперацийДУ.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДоговорДУ",СписокДоговоровДУ);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаПериода));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаПериода));
	
	Если ГруппаРегламентныхОпераций.Пустая() Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ПланРегламентныхОперацийДУ.ГруппаОперацийПользователя = &ГруппаОперацийПользователя", "");
	Иначе
	    Запрос.УстановитьПараметр("ГруппаОперацийПользователя", ГруппаРегламентныхОпераций);
	КонецЕсли;
	
	ДокументыПоДоговорам = Запрос.Выполнить().Выгрузить();
	#Вставка
	// IMDEV-8899 3.6
	ДокументыПоДоговорам.Индексы.Добавить("ДоговорДУ,ГруппаОперацийПользователя");
	#КонецВставки
	
	////Отменяем проведение по документам.
	//Если НЕ УчитыватьВыполненные Тогда
	//	Попытка
	//		Для каждого ТекДокумент Из ДокументыПоДоговорам Цикл
	//			Если ТекДокумент.Проведен = Истина Тогда
	//				ДокОбъект = ТекДокумент.Ссылка.ПолучитьОбъект();
	//				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	//				Документы.ПланРегламентныхОперацийДУ.ПометитьНаУдалениеПодчиненныеДокументы(ТекДокумент.Ссылка)
	//			КонецЕсли;
	//		КонецЦикла;
	//	Исключение
	//	КонецПопытки;
	//КонецЕсли;
	
	МассивФоновыхЗаданий = Новый Массив;
	КоличествоПотоков = Константы.МаксимальноеКоличествоПараллельныхПотоков.Получить();
	МассивРодителей =  ОбщегоНазначенияБПВызовСервера.УдалитьПовторяющиесяЭлементыМассива(СписокОпераций.ВыгрузитьКолонку("ГруппаОперацийПользователя"));	
	
	ПараметрыСохранения = Новый Структура("СписокОпераций, ДокументыПоДоговорам, МассивФоновыхЗаданий, КоличествоПотоков, МассивРодителей", СписокОпераций, ДокументыПоДоговорам, МассивФоновыхЗаданий, КоличествоПотоков, МассивРодителей );
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ПараметрыСохранения, ЭтаФорма.УникальныйИдентификатор);
	
	Возврат  СписокДоговоровДУ;
	
КонецФункции
